{
  "common": {
    "loading": "Carregant...",
    "error": "Error",
    "next": "Seg眉ent",
    "previous": "Anterior",
    "finish": "Acabar",
    "share": "Compartir",
    "tryAgain": "Intentar de nou"
  },
  "landing": {
    "title": "Descobreix qu猫 tan b茅 coneixes la teva m煤sica favorita",
    "subtitle": "Enganxa la teva playlist de Spotify i prepara't per al desafiament musical definitiu",
    "urlPlaceholder": "https://open.spotify.com/playlist/...",
    "createQuiz": "Crear el meu Quiz Musical!",
    "howItWorks": {
      "title": "Com funciona?",
      "step1": " Enganxa la teva playlist de Spotify",
      "step2": " Respon les preguntes musicals",
      "step3": " Comparteix la teva puntuaci贸"
    },
    "urlRequired": "Si us plau, introdueix una URL de playlist vlida",
    "urlInvalid": "URL de Spotify no vlida"
  },
  "quiz": {
    "progress": "Pregunta {{current}} de {{total}}",
    "score": "Puntuaci贸: {{score}}",
    "correct": "Correcte!",
    "incorrect": "Incorrecte",
    "nextQuestion": "Seg眉ent pregunta",
    "seeResults": "Veure resultats"
  },
  "results": {
    "title": "Quiz completat!",
    "scoreTitle": "La teva puntuaci贸 final",
    "messages": {
      "perfect": " Ets l'MVP d'aquesta playlist!",
      "excellent": " S貌lid! Definitivament coneixes la teva m煤sica",
      "good": " B茅... almenys tens un gust musical excel路lent",
      "fair": " Aquesta playlist t'est ensenyant coses noves",
      "poor": " Segur que aquesta 茅s la teva playlist? "
    },
    "playAgain": " Una altra ronda, si us plau",
    "shareText": "He obtingut {{score}} de {{total}} al meu Quiz Musical de Spotify! "
  },
  "privacy": {
    "title": "Pol铆tica de Privacitat",
    "lastUpdated": "ltima actualitzaci贸: 15 de gener de 2026",
    "intro": {
      "title": "1. Introducci贸",
      "p1": "Benvingut a Spotify Quiz, una aplicaci贸 dissenyada per posar a prova el teu coneixement musical a trav茅s de q眉estionaris interactius basats en playlists de Spotify. Aquesta aplicaci贸 ha estat creada i 茅s mantinguda per scar R贸denas.",
      "p2": "La teva privacitat 茅s important per a nosaltres. Aquesta pol铆tica de privacitat explica quina informaci贸 es recopila (i, el que 茅s m茅s important, quina no es recopila), com s'utilitza i com protegim les teves dades quan utilitzes Spotify Quiz."
    },
    "dataNotCollected": {
      "title": "2. Dades que No Recopilem",
      "p1": "Spotify Quiz est dissenyat per funcionar sense recopilar informaci贸 personal identificable dels seus usuaris. Aix貌 significa que:",
      "items": [
        "No recopilem noms, adreces de correu electr貌nic, n煤meros de tel猫fon ni cap altra informaci贸 que pugui identificar-te directament.",
        "No et demanem que inici茂s sessi贸 amb el teu compte de Spotify. Per tant, no tenim acc茅s a les teves dades d'inici de sessi贸 de Spotify, historial d'escolta, playlists privades ni cap altra informaci贸 personal associada al teu compte de Spotify.",
        "No emmagatzemem els teus resultats de quiz ni el teu progr茅s. Tota la informaci贸 del quiz es processa en temps real i no es desa un cop tanques l'aplicaci贸."
      ]
    },
    "dataAccessed": {
      "title": "3. Dades a les quals Accedim (API de Spotify)",
      "p1": "Per generar els q眉estionaris, Spotify Quiz interactua amb l'API p煤blica de Spotify. A trav茅s d'aquesta API, accedim 煤nicament a informaci贸 p煤blica de playlists, que inclou:",
      "items": [
        "Noms de playlists i les seves descripcions p煤bliques.",
        "Noms de can莽ons, artistes, lbums i les seves durades.",
        "Dates de llan莽ament dels lbums."
      ],
      "p2": "Aquesta informaci贸 s'utilitza exclusivament amb el prop貌sit de crear i presentar els q眉estionaris. La teva interacci贸 amb l'API de Spotify a trav茅s de la nostra aplicaci贸 es limita a l'acc茅s a dades p煤bliques. Spotify Quiz no pot realitzar accions en nom teu a Spotify."
    },
    "thirdParty": {
      "title": "4. Serveis de Tercers",
      "p1": "Spotify Quiz utilitza els seg眉ents serveis de tercers:",
      "items": [
        "<strong>API de Spotify:</strong> Per obtenir les dades de les playlists. Et recomanem revisar la <a href=\"https://www.spotify.com/es/privacy\" target=\"_blank\" rel=\"noopener noreferrer\">Pol铆tica de Privacitat de Spotify</a>.",
        "<strong>Google Analytics:</strong> Utilitzem Google Analytics per comprendre com els usuaris interactuen amb la nostra aplicaci贸. Aix貌 ens ajuda a millorar la funcionalitat i l'experi猫ncia d'usuari. Google Analytics recopila informaci贸 anonimitzada, com el tipus de navegador, el sistema operatiu, les pgines visitades i el temps de perman猫ncia a l'aplicaci贸. Aquesta informaci贸 no t'identifica personalment. Pots obtenir m茅s informaci贸 sobre com Google utilitza les dades a la seva <a href=\"https://policies.google.com/privacy\" target=\"_blank\" rel=\"noopener noreferrer\">Pol铆tica de Privacitat de Google</a>."
      ]
    },
    "cookies": {
      "title": "5. Galetes i Emmagatzematge Local/de Sessi贸",
      "p1": "Spotify Quiz utilitza tecnologies d'emmagatzematge web per millorar la teva experi猫ncia:",
      "items": [
        "<strong>Local Storage:</strong> S'utilitza per recordar les teves prefer猫ncies d'idioma i tema (clar/fosc) entre sessions de navegaci贸. Aix貌 permet que l'aplicaci贸 es carregui amb els teus ajustos preferits sense necessitat de restablir-los.",
        "<strong>Session Storage:</strong> Es pot utilitzar per emmagatzemar temporalment informaci贸 relacionada amb el quiz actual mentre ests actiu a l'aplicaci贸, com el progr茅s del quiz, la puntuaci贸 i les respostes. Aquesta informaci贸 s'elimina automticament quan tanques la finestra o pestanya del navegador.",
        "<strong>Galetes (Cookies):</strong> Google Analytics pot utilitzar galetes per recopilar dades d'煤s de forma anonimitzada."
      ],
      "p2": "Aquestes tecnologies s'utilitzen per al funcionament essencial de l'aplicaci贸 i per a finalitats anal铆tiques (Google Analytics) i no per identificar-te personalment."
    },
    "policyChanges": {
      "title": "6. Canvis en aquesta Pol铆tica",
      "p1": "Ens reservem el dret d'actualitzar aquesta Pol铆tica de Privacitat en qualsevol moment. Qualsevol canvi ser publicat en aquesta pgina amb una nova data d'\"ltima actualitzaci贸\". T'animem a revisar aquesta pol铆tica peri貌dicament per estar informat sobre com protegim la teva informaci贸."
    },
    "contact": {
      "title": "7. Contacte",
      "p1": "Si tens alguna pregunta sobre aquesta Pol铆tica de Privacitat, pots contactar amb l'scar R贸denas a la seg眉ent adre莽a de correu electr貌nic: <a href=\"mailto:oscarrodenaslujan@gmail.com\">oscarrodenaslujan@gmail.com</a>."
    }
  }
}