{
  "common": {
    "loading": "Cargando...",
    "error": "Error",
    "next": "Siguiente",
    "previous": "Anterior",
    "finish": "Finalizar",
    "share": "Compartir",
    "tryAgain": "Intentar de nuevo"
  },
  "landing": {
    "title": "Descubre qu茅 tanto conoces tu m煤sica favorita",
    "subtitle": "Pega tu playlist de Spotify y prep谩rate para el desaf铆o musical definitivo",
    "urlPlaceholder": "https://open.spotify.com/playlist/...",
    "createQuiz": "隆Crear mi Quiz Musical!",
    "howItWorks": {
      "title": "驴C贸mo funciona?",
      "step1": " Pega tu playlist de Spotify",
      "step2": " Responde las preguntas musicales", 
      "step3": " Comparte tu puntuaci贸n"
    },
    "urlRequired": "Por favor, ingresa una URL de playlist v谩lida",
    "urlInvalid": "URL de Spotify no v谩lida"
  },
  "quiz": {
    "progress": "Pregunta {{current}} de {{total}}",
    "score": "Puntuaci贸n: {{score}}",
    "correct": "隆Correcto!",
    "incorrect": "Incorrecto",
    "nextQuestion": "Siguiente pregunta",
    "seeResults": "Ver resultados"
  },
  "results": {
    "title": "隆Quiz completado!",
    "scoreTitle": "Tu puntuaci贸n final",
    "messages": {
      "perfect": " 隆Eres el MVP de esta playlist!",
      "excellent": " 隆S贸lido! Definitivamente conoces tu m煤sica",
      "good": " Bueno... al menos tienes excelente gusto musical",
      "fair": " Esta playlist te est谩 ense帽ando cosas nuevas",
      "poor": " 驴Seguro que esta es tu playlist? "
    },
    "playAgain": " Otra ronda, por favor",
    "shareText": "隆Obtuve {{score}} de {{total}} en mi Quiz Musical de Spotify! "
  },
  "privacy": {
    "title": "Pol铆tica de Privacidad",
    "lastUpdated": "ltima actualizaci贸n: 15 de enero de 2026",
    "intro": {
      "title": "1. Introducci贸n",
      "p1": "Bienvenido a Spotify Quiz, una aplicaci贸n dise帽ada para poner a prueba tu conocimiento musical a trav茅s de quizzes interactivos basados en playlists de Spotify. Esta aplicaci贸n ha sido creada y es mantenida por scar R贸denas.",
      "p2": "Tu privacidad es importante para nosotros. Esta pol铆tica de privacidad explica qu茅 informaci贸n se recopila (y, lo que es m谩s importante, qu茅 no se recopila), c贸mo se utiliza y c贸mo protegemos tus datos cuando utilizas Spotify Quiz."
    },
    "dataNotCollected": {
      "title": "2. Datos que No Recopilamos",
      "p1": "Spotify Quiz est谩 dise帽ado para funcionar sin recopilar informaci贸n personal identificable de sus usuarios. Esto significa que:",
      "items": [
        "No recopilamos nombres, direcciones de correo electr贸nico, n煤meros de tel茅fono ni ninguna otra informaci贸n que pueda identificarte directamente.",
        "No te pedimos que inicies sesi贸n con tu cuenta de Spotify. Por lo tanto, no tenemos acceso a tus datos de inicio de sesi贸n de Spotify, historial de escucha, playlists privadas ni ninguna otra informaci贸n personal asociada a tu cuenta de Spotify.",
        "No almacenamos tus resultados de quiz ni tu progreso. Toda la informaci贸n del quiz se procesa en tiempo real y no se guarda una vez que cierras la aplicaci贸n."
      ]
    },
    "dataAccessed": {
      "title": "3. Datos a los que Accedemos (API de Spotify)",
      "p1": "Para generar los quizzes, Spotify Quiz interact煤a con la API p煤blica de Spotify. A trav茅s de esta API, accedemos 煤nicamente a informaci贸n p煤blica de playlists, que incluye:",
      "items": [
        "Nombres de playlists y sus descripciones p煤blicas.",
        "Nombres de canciones, artistas, 谩lbumes y sus duraciones.",
        "Fechas de lanzamiento de los 谩lbumes."
      ],
      "p2": "Esta informaci贸n se utiliza exclusivamente para el prop贸sito de crear y presentar los quizzes. Tu interacci贸n con la API de Spotify a trav茅s de nuestra aplicaci贸n se limita al acceso a datos p煤blicos. Spotify Quiz no puede realizar acciones en tu nombre en Spotify."
    },
    "thirdParty": {
      "title": "4. Servicios de Terceros",
      "p1": "Spotify Quiz utiliza los siguientes servicios de terceros:",
      "items": [
        "<strong>API de Spotify:</strong> Para obtener los datos de las playlists. Te recomendamos revisar la <a href=\"https://www.spotify.com/es/privacy\" target=\"_blank\" rel=\"noopener noreferrer\">Pol铆tica de Privacidad de Spotify</a>.",
        "<strong>Google Analytics:</strong> Utilizamos Google Analytics para comprender c贸mo los usuarios interact煤an con nuestra aplicaci贸n. Esto nos ayuda a mejorar la funcionalidad y la experiencia de usuario. Google Analytics recopila informaci贸n anonimizada, como el tipo de navegador, el sistema operativo, las p谩ginas visitadas y el tiempo de permanencia en la aplicaci贸n. Esta informaci贸n no te identifica personalmente. Puedes obtener m谩s informaci贸n sobre c贸mo Google utiliza los datos en su <a href=\"https://policies.google.com/privacy\" target=\"_blank\" rel=\"noopener noreferrer\">Pol铆tica de Privacidad de Google</a>."
      ]
    },
    "cookies": {
      "title": "5. Cookies y Almacenamiento Local/de Sesi贸n",
      "p1": "Spotify Quiz utiliza tecnolog铆as de almacenamiento web para mejorar tu experiencia:",
      "items": [
        "<strong>Local Storage:</strong> Se utiliza para recordar tus preferencias de idioma y tema (claro/oscuro) entre sesiones de navegaci贸n. Esto permite que la aplicaci贸n se cargue con tus ajustes preferidos sin necesidad de restablecerlos.",
        "<strong>Session Storage:</strong> Puede utilizarse para almacenar temporalmente informaci贸n relacionada con el quiz actual mientras est谩s activo en la aplicaci贸n, como el progreso del quiz, la puntuaci贸n y las respuestas. Esta informaci贸n se elimina autom谩ticamente cuando cierras la ventana o pesta帽a del navegador.",
        "<strong>Cookies:</strong> Google Analytics puede utilizar cookies para recopilar datos de uso de forma anonimizada."
      ],
      "p2": "Estas tecnolog铆as se utilizan para el funcionamiento esencial de la aplicaci贸n y para fines anal铆ticos (Google Analytics) y no para identificarte personalmente."
    },
    "policyChanges": {
      "title": "6. Cambios en esta Pol铆tica",
      "p1": "Nos reservamos el derecho de actualizar esta Pol铆tica de Privacidad en cualquier momento. Cualquier cambio ser谩 publicado en esta p谩gina con una nueva fecha de \"ltima actualizaci贸n\". Te animamos a revisar esta pol铆tica peri贸dicamente para estar informado sobre c贸mo protegemos tu informaci贸n."
    },
    "contact": {
      "title": "7. Contacto",
      "p1": "Si tienes alguna pregunta sobre esta Pol铆tica de Privacidad, puedes contactar con scar R贸denas en la siguiente direcci贸n de correo electr贸nico: <a href=\"mailto:oscarrodenaslujan@gmail.com\">oscarrodenaslujan@gmail.com</a>."
    }
  }
}